#include<stdio.h>

//int main() {

	//printf("%d\n", sizeof(char));
	//printf("%d\n", sizeof(short));
	//printf("%d\n", sizeof(int ));
	//printf("%d\n", sizeof(long));
	//printf("%d\n", sizeof(float));
	//printf("%d\n", sizeof(double));
	//printf("%d\n", sizeof(long long));

	/*整型---char/short/int/long*/
	/*浮点型-----double/float*/

	/*构造类型:自定义类型*/
	/*
	> 数组类型
	> 结构体类型 struct
	> 枚举类型 enum
	> 联合类型 union
	*/

	/*指针类型*/
	/*
	int *pi;
	char *pc;
	float* pf;
	void* pv;  无具体类型的指针
	*/

	/*空类型 void*/


	/*原码、反码、补码*/
	//int a = 20;
	//原码：0000 0000 0000 0000 0000 0000 0001 0100
	//反码：0000 0000 0000 0000 0000 0000 0001 0100
	//补码：0000 0000 0000 0000 0000 0000 0001 0100
	//0x00000014
	//int b = -10;
	//原码：1000 0000 0000 0000 0000 0000 0000 1010
	//反码：1111 1111 1111 1111 1111 1111 1111 0101
	//补码：1111 1111 1111 1111 1111 1111 1111 0110
	//0xFFFFFF
//	return 0;
//}

/*大小端判断，当前机器的字节序*/
//大端：低位字节放在内存高地址，小端：低位字节放在内存低地址
//如int 1    大端：0x00000001 小端：0x01000000
//int check_sys(void) {
//	int a = 1;
//	char* t = (char*)&a;
//	return *t; //大端返回0，小端返回1  //简化版本：return *(char*)&a;
//}
//int main() {
//	
//	
//	int ret = check_sys();
//	if (ret == 1) {
//		printf("小端.\n");
//	}
//	else {
//		printf("大端.\n");
//	}
//}


//int main() {
//	
//	//1000 0000 0000 0000 0000 0000 0000 0001
//	//1111 1111 1111 1111 1111 1111 1111 1110
//	//1111 1111 1111 1111 1111 1111 1111 1111
//
//	char a = -1;//1111 1111->整型提升 1111 1111 1111 1111 1111 1111 1111 1111
//	signed char b = -1;//111111111->整型提升 1111 1111 1111 1111 1111 1111 1111 1111   符号数的整型提升高位补符号位
//	unsigned char c = -1;//11111111->整型提升 0000 0000 0000 0000 0000 0000 1111 1111  无符号的整型提升高位直接补零
//	printf("a=%d, b=%d, c=%d",a,b,c);
//	return 0;
//}


//int main() {
//	//-128
//	//1000 0000 0000 0000 0000 0000 1000 0000
//	//1111 1111 1111 1111 1111 1111 0111 1111
//	//1111 1111 1111 1111 1111 1111 1000 0000
//
//	char a = -128;
//	//1000 0000->整形提升：1111 1111 1111 1111 1111 1111 1000 0000    补码
//
//	printf("%u\n",a); //%u：打印十进制的无符号数字
//	return 0;
//}


//int main() {
//	//128 = -128
//	//1000 0000 0000 0000 0000 0000 1000 0000
//	//1111 1111 1111 1111 1111 1111 0111 1111
//	//1111 1111 1111 1111 1111 1111 1000 0000
//
//	char a = 128;
//	//1000 0000->整形提升：1111 1111 1111 1111 1111 1111 1000 0000    补码
//
//	printf("%u\n", a); //%u：打印十进制的无符号数字
//	return 0;
//}


//int main() {
//	int i = -20;
//	unsigned int j = 10;
//	printf("%d\n", i + j);
//	return 0;
//}

//int main() {
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}




//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d\n", sizeof(a));
//	return 0;
//}


//#include <stdio.h>
//unsigned char i = 0;
//int main()
//{
//	for (i = 0; i <= 255; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}


/*浮点数在内存中的存储*/
int main()
{
	int n = 9;
	//0000 0000 0000 0000 0000 0000 0000 1001 --补码
	//0 00000000 00000000000000000001001
	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat); //0
	//(-1)^0 * 00000000000000000001001 * 2^(-126)


	*pFloat = 9.0;
	//1001.0
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000000

	printf("num的值为：%d\n", n); // 1,091,567,616
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}

//9.0
//1001.0
//(-1)^s*	M*		2^E
//(-1)^0*	1.001*	2^3  科学计数法二进制表示浮点数


//int main() {
//	float a= 5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011 * 2^2
//	//S=0;
//	//M=1.01
//	//E=2
//	//0 10000001			01100000000000000000000
//	//s E+127(加上偏移量)    M(补齐23位)
//	//01000000101100000000000000000000 = 0x40b00000
//	return 0;
//}